Tekla.Structures.Analysis.AnalysisCrossSection
The AnalysisCrossSection class contains information related to analysis cross sections.

Tekla.Structures.Analysis.AnalysisCrossSection._Name
The name of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Calculated
This indicates whether section values have been calculated.

Tekla.Structures.Analysis.AnalysisCrossSection._AnalysisSubSections
The sub sections of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._A
The cross section area (m2) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Iyy
The moment of inertia about Y-axis (m4) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Izz
The moment of inertia about Z-axis (m4) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._It
The torsion moment (m4) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Iy
The radius of gyration about Y-axis (m) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Iz
The radius of gyration about Z-axis (m) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Wyy
The elastic modulus about Y-axis (m3) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Wzz
The elastic modulus about Z-axis (m3) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Wplyy
The plastic modulus about Y-axis (m3) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Wplzz
The plastic modulus about Z-axis (m3) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Avy
The shear area for loads parallel to the Y-axis (m2) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Avz
The shear area for loads parallel to the Z-axis (m2) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._Iw
The warping constant (m6) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection._G
The mass per unit of length (kg/m) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.#ctor
Creates a new instance of an analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Name
The name of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.AnalysisSubSections
The subsections of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Calculated
Indicates whether section values have been calculated.

Tekla.Structures.Analysis.AnalysisCrossSection.A
The cross section area (m2) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Iyy
The moment of inertia about the Y-axis (m4) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Izz
The moment of inertia about the Z-axis (m4) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.It
The torsion moment (m4) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Iy
The radius of gyration about the Y-axis (m) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Iz
The radius of gyration about the Z-axis (m) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Wyy
The elastic modulus about the Y-axis (m3) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Wzz
The elastic modulus about the Z-axis (m3) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Wplyy
The plastic modulus about the Y-axis (m3) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Wplzz
The plastic modulus about the Z-axis (m3) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Avy
The shear area for loads parallel to the Y-axis (m2) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Avz
The shear area for loads parallel to the Z-axis (m2) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Iw
The warping constant (m6) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.G
The mass per unit of length (kg/m) of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Insert
Inserts an analysis cross section.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisCrossSection.Select
Selects an analysis cross section.
The AnalysisModelName has to be set.
The ID or Name has to be set.

Tekla.Structures.Analysis.AnalysisCrossSection.Delete
Deletes an analysis cross section.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisCrossSection.GetCrossSectionGroup
Gets the cross section group.
Returns: The cross section group.

Tekla.Structures.Analysis.AnalysisCrossSection.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisCrossSection.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisCrossSection.DeleteInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisCrossSection.InsertData
Inserts data.

Tekla.Structures.Analysis.AnalysisCrossSection.CollectData
Collects data.